import { Col, Container, Row } from "react-bootstrap";
import HeadLines from "../headLine/HeadLines";
// import { treatingDiseases } from "./../../data/treatingDiseases";
// import { categories } from "../../data/categories";
import "../HerbalData/herbalData.css";
import { useState } from "react";
import { Link } from 'react-router-dom';
function TreatingDiseases() {
  const data1 = [
    {
      id: 9,
      category: " الحساسيه",
      title: "العلاقة بين الربو وامراض القلب",
      image: "assets/treating diseeses/image3.jpg",
      description: "",
    },
    {
      id: 8,
      category: " الحساسيه",
      title: "العلاج الافضل لمتلازمه التمثيل الغزائي",
      image: "assets/treating diseeses/image8.jpg",
      description:
        "تعتبر متلازمة التمثيل الغذائي من الحالات الصحية التي تتطلب عناية خاصة وعلاج متخصص. وفي هذا المقال سنسلط الضوء على العلاج الأفضل لمتلازمة التمثيل الغذائي. تغذية متوازنة: يعد تناول طعام صحي ومتوازن أحد أهم عوامل علاج متلازمة التمثيل الغذائي. يجب تضمين جميع المجموعات الغذائية بشكل مناسب في وجباتك اليومية. مراقبة الوزن: من المهم مراقبة وزنك بانتظام للحفاظ على صحة جسدك والوقاية من مشاكل صحية أخرى.",
    },
    {
      id: 7,
      category: "السرطان",
      title: "فوائد الثوم الصحية",
      image: "assets/treating diseeses/image9.jpg",
      description:
        "يعتبر الثوم من الأطعمة الصحية والمفيدة للجسم، ويحتوي على العديد من الفوائد الصحية، منها: يحتوي الثوم على مركبات كبريتية تساعد في خفض ضغط الدم وتحسين صحة القلب. يعتبر الثوم مضاداً للبكتيريا والفطريات، مما يساعد في تقوية جهاز المناعة.",
    },

    {
      id: 10,
      category: " الحساسيه",
      title: "فوائد بزور الكتان",
      image: "assets/treating diseeses/image10.jpg",
      description:
        "تشير بعض الدراسات إلى أن التهابات الشعبية المزمنة التي تحدث في حالات الربو قد تؤدي إلى تضخم في عضلة القلب وتغيرات في نسيجه، مما يزيد من خطر الإصابة بأمراض قلبية مثل احتشاء عضلة القلب وارتفاع ضغط الدم.",
    },
  ];
  const data2 = [
    {
      id: 11,
      category: "السرطان",
      title: "فوائد الثوم الصحية",
      image: "assets/treating diseeses/image9.jpg",
      description:
        "يعتبر الثوم من الأطعمة الصحية والمفيدة للجسم، ويحتوي على العديد من الفوائد الصحية، منها: يحتوي الثوم على مركبات كبريتية تساعد في خفض ضغط الدم وتحسين صحة القلب. يعتبر الثوم مضاداً للبكتيريا والفطريات، مما يساعد في تقوية جهاز المناعة.",
    },
  ];
  const data3 = [
    {
      id: 12,
      category: "صحة الجهاز الهضمي",
      title: "هل تقلل الحمضيات خطر الاصابة بالخرف",
      image: "assets/treating diseeses/image4.jpg",
      description:
        "توجد بعض الدراسات التي تشير إلى أن تناول الحمضيات والفواكه الحمضية بشكل عام، مثل البرتقال والليمون والجريب فروت، قد يساهم في تقليل خطر الإصابة بأمراض مثل الخرف. تحتوي الحمضيات على مضادات الأكسدة والفيتامينات المفيدة للصحة العامة، والتي قد تساعد في حماية الدماغ والحفاظ على وظائفه العقلية.",
    },
    {
      id: 13,
      category: "صحة الجهاز الهضمي",
      title: "التخلص من الامساك عن طريق الماء",
      image: "assets/treating diseeses/image5.jpg",
      description:
        "الماء هو عنصر أساسي لصحة الجهاز الهضمي ويمكن أن يلعب دوراً هاماً في علاج الإمساك. إليك بعض الطرق التي يمكن استخدام الماء للتخلص من الإمساك: زيادة تناول الماء: تناول كمية كافية من الماء يومياً يساعد على تليين البراز وتحفيز حركة الأمعاء، مما يساعد في التخلص من الإمساك. شرب الماء الدافئ: شرب كوب من الماء الدافئ صباحاً على معدة فارغة يمكن أن يحفز حركة الأمعاء ويسهل عملية الهضم.",
    },

    {
      id: 14,
      category: "صحة الجهاز الهضمي",
      title: "فوائد الثوم الصحية",
      image: "assets/treating diseeses/image9.jpg",
      description:
        "يعتبر الثوم من الأطعمة الصحية والمفيدة للجسم، ويحتوي على العديد من الفوائد الصحية، منها: يحتوي الثوم على مركبات كبريتية تساعد في خفض ضغط الدم وتحسين صحة القلب. يعتبر الثوم مضاداً للبكتيريا والفطريات، مما يساعد في تقوية جهاز المناعة.",
    },
    {
      id: 15,
      category: "صحة الجهاز الهضمي",
      title: "فوائد زيت السمك",
      image: "assets/treating diseeses/image11.jpg",
      description:
        "زيت السمك هو مصدر قيم للعديد من العناصر الغذائية الهامة، ويعتبر من بين الإضافات الغذائية الأكثر فائدة للصحة والعافية. يُستخرج زيت السمك عادةً من أسماك مثل السلمون والتونة والسردين، ويحتوي على نسب عالية من أحماض أوميغا-3 وفيتامينات ومعادن أخرى. في هذا المقال، سنتناول فوائد زيت السمك للصحة والتأثير الإيجابي الذي يمكن أن يكون له على جسم الإنسان. الأحماض الدهنية أوميغا-",
    },
  ];
  const data4 = [
    {
      id: 16,
      category: "القلب والاوعيه الدمويه",
      title: "الكوليسترول وصحة القلب",
      image: "assets/treating diseeses/image13.jpg",
      description:
        "الكوليسترول هو مركب دهني ضروري للجسم، لكن تراكمه الزائد قد يؤدي إلى مشاكل صحية خطيرة، مثل أمراض القلب. في هذا المقال، سنتعرف على أهمية مراقبة مستويات الكوليسترول وكيفية الحفاظ على صحة قلبية جيدة بأساليب تتوافق مع تقنيات السيو.",
    },
    {
      id: 17,
      category: "القلب والاوعيه الدمويه",
      title: "فوائد القهوة للقلب والجسم والبشره والصحة العامة",
      image:"assets/treating diseeses/image12.jpg",
      description:
        " يجب تناول القهوة بشكل معتدل، حيث إفراطها قد يؤدي إلى الأعراض الجانبية مثل القلق واضطراب المعدة. ينصح بعدم إضافة كميات كبيرة من السكر والدهون إلى القهوة للحفاظ على فوائدها الصحية. القهوة ليست مناسبة للجميع، فبعض الأشخاص قد يكونون حساسين للكافيين ويحتاجون إلى تقليل استهلاكها.",
    },
    {
      id: 18,
      category: "القلب والاوعيه الدمويه",
      title: "فوائد الثوم الصحية",
      image: "assets/treating diseeses/image9.jpg",
      description:
        "يعتبر الثوم من الأطعمة الصحية والمفيدة للجسم، ويحتوي على العديد من الفوائد الصحية، منها: يحتوي الثوم على مركبات كبريتية تساعد في خفض ضغط الدم وتحسين صحة القلب. يعتبر الثوم مضاداً للبكتيريا والفطريات، مما يساعد في تقوية جهاز المناعة.",
    },
    {
      id: 19,
      category: "القلب والاوعيه الدمويه",
      title: "المواد الطبيعية التي تساعد في خفض ضغط الدم المرتفع",
      image:"assets/treating diseeses/image14.jpg",
      description:
        "البوتاسيوم,الزنك,الفيتامين ,المغنيسيوم,الثوم,الزنجبيل,الألياف,الزعرور,الاهتمام بصحة القلب وخفض ضغط الدم يتطلب تضمين هذه المواد الطبيعية في نظامك الغذائي والحفاظ على نمط حياة صحي. يجب أن يكون النصائح الغذائية والتغييرات في نمط الحياة جزءًا من استراتيجيتك للمحافظة على صحة قلبك وتجنب مضاعفات ضغط الدم المرتفع.",
    },
  ];
  const data5 = [
    {
      id: 20,
      title: "طرق لتبيض الاسنان بشكل طبيعي",
      image: "assets/treating diseeses/image15.png",
      category: "صحة الاسنان",
      description:
        "1. استخدم خل التفاح من المنطقي أن يكون خل التفاح (ACV)، الذي يعمل بشكل فعال كمضاد حيوي طبيعي ومنظف للأسنان / اللثة، قادراً أيضاً على إزالة البقع العنيدة على الأسنان. خل التفاح مفيد بشكل خاص في إزالة البقع بسبب المسببات الشائعة مثل القهوة والنيكوتين (التدخين). يحتوي على مركبات، بما في ذلك حمض الأسيتيك والبوتاسيوم والمغنيسيوم والبروبيوتيك والإنزيمات، التي تقتل الجراثيم (البكتيريا “السيئة” الخطرة) وفي نفس الوقت تعزز نمو بكتيريا البروبيوتيك المفيدة “الجيدة”. نظراً لكونه حامضياً بشكل طبيعي، فإنه يساعد في تكسير البلاك أو المواد الأخرى الملتصقة بالأسنان.",
    },
  ];

  const [dataMap, setDataMap] = useState(data1);
  const setSection1 = () => {
    setDataMap(data1);
  };
  const setSection2 = () => {
    setDataMap(data2);
  };
  const setSection3 = () => {
    setDataMap(data3);
  };
  const setSection4 = () => {
    setDataMap(data4);
  };
  const setSection5 = () => {
    setDataMap(data5);
  };
  return (
    <div>
      <Container>
        <HeadLines title={"علاج الامراض طبيعيا"} />
        <div className="categories-box">
          <div className="cat-box" onClick={setSection1}>
            <Link>الحساسيه</Link>
          </div>
          <div className="cat-box" onClick={setSection2}>
            <Link>السرطان</Link>
          </div>
          <div className="cat-box" onClick={setSection3}>
            <Link>صحة الجهاز الهضمي</Link>
          </div>
          <div className="cat-box" onClick={setSection4}>
            <Link>القلب والاوعيه الدمويه</Link>
          </div>
          <div className="cat-box" onClick={setSection5}>
            <Link>صحة الاسنان</Link>
          </div>
        </div>

        <Row>
          {dataMap.map((el) => {
            return (
              <Col sm={12} lg={4} md={6} key={el.id}>
                <div className="herbal-treatment">
                  <img className="herbal-treat-image" src={el.image} alt="" />
                  <p className="herbal-treat-title">{el.title}</p>
                </div>
              </Col>
            );
          })}
        </Row>
      </Container>
    </div>
  );
}

export default TreatingDiseases;
