export const allData = [
  {
    id: 1,
    title: "شاي المليسة",
    image: "../../public/assets/herbal-treatment/melisa.png",
    description:
      "عشبة المورينجا، المعروفة أيضًا بـ”شجرة العشاء” أو “شجرة العسل”، هي نبات يعود أصله إلى جنوب آسيا، وقد اكتسبت شهرة عالمية بفضل فوائدها الصحية المذهلة. تعتبر المورينجا واحدة من أكثر النباتات تنوعًا وفوائدًا في عالم الأعشاب والنباتات الطبية. إذا كنت تتساءل عن ما تحمله عشبة المورينجا بالنسبة لك، فستكتشف أن هذا النبات الرائع يحمل في طياته الكثير من الخير للصحة والعافية",
  },
  {
    id: 2,
    title: " عشبة المورينجا",
    image: "../../public/assets/herbal-treatment/moringa.png",
    description:
      "عشبة المورينجا، المعروفة أيضًا باسم شجرة المورينجا أو شجرة النيم، تعتبر واحدة من النباتات الطبية والغذائية المهمة في العديد من الثقافات حول العالم. وتشتهر بفوائدها الصحية المتعددة، ومن بين الفوائد الرئيسية لعشبة المورين غنية بالمغذيات: تحتوي عشبة المورينجا على مجموعة واسعة من الفيتامينات والمعادن الأساسية مثل فيتامين C وفيتامين A والبوتاسيوم والكالسيوم والحديد والمغنيسيوم، مما يجعلها مصدرًا غنيًا بالمغذيات.",
  },
  {
    id: 3,
    title: " فوائد البردقوش",
    image: "../../public/assets/herbal-treatment/bardakosh.png",
    description:
      "البردقوش هو نبات عطري يستخدم في الطهي والطبخ، ويتميز بنكهته القوية والعطرية. وله العديد من الفوائد الصحية المحتملة، من بينها: تحسين الهضم: يُعتقد أن البردقوش يساعد في تحفيز عملية الهضم وتخفيف الانتفاخ والغازات في الجهاز الهضمي. تهدئة القلق: يُعتقد أن استنشاق رائحة البردقوش يمكن أن يساعد في تهدئة الأعصاب وتخفيف القلق والتوتر. مضاد للالتهابات: يحتوي البردقوش على مركبات تمتلك خصائص مضادة للالتهابات، مما يمكن أن يساعد في تخفيف الالتهابات في الجسم.",
  },
  {
    id: 4,
    title: " الميرمية: النبات العلاجي الرائع",
    image: "../../public/assets/herbal-treatment/mirmia.png",
    description:
      "الميرمية هي نبات علاجي رائع يستخدم منذ العصور القديمة لفوائدها الصحية المتعددة. إليك بعض الفوائد الشهيرة للميرمية: تحسين صحة الجهاز الهضمي: الميرمية تُستخدم لتهدئة الأمعاء الملتهبة وتخفيف الغازات الناتجة عن الهضم، وتعزيز صحة الجهاز الهضمي بشكل عام. خصائص مضادة للبكتيريا والفطريات: يُعتقد أن الميرمية تحتوي على مركبات تمتلك خصائص مضادة للبكتيريا والفطريات، مما يجعلها مفيدة في مكافحة العدوى والالتهابات. تهدئة الحكة والتهيج: يُستخدم زيت الميرمية على الجلد لتهدئة الحكة والتهيج الناتج عن الحروق أو الحشرات أو الحساسية.",
  },
  {
    id: 5,
    title: " فوائد البابونج",
    image: "../../public/assets/herbal-treatment/babong.png",
    description:
      "البابونج هو نبات عشبي معروف بفوائده الصحية والعلاجية المتعددة، وقد تم استخدامه في الطب الشعبي لآلاف السنين. إليك بعض الفوائد الشهيرة للبابونج: تهدئة الأعصاب والتخفيف من القلق: يُعتبر البابونج مهدئًا طبيعيًا للأعصاب، ويستخدم لتخفيف التوتر والقلق، وتحسين النوم. تخفيف الآلام: يُعتقد أن البابونج له تأثير مسكن يساعد في تخفيف الألم، سواء كان الألم ناتجًا عن الصداع أو التهاب المفاصل أو الحيض. تحسين الهضم: يُستخدم البابونج لتهدئة الجهاز الهضمي وتخفيف الغازات والانتفاخات وتحسين الهضم بشكل عام",
  },
  {
    id: 6,
    title: "شاي ابرة الصنوبر ",
    image: "../../public/assets/herbal-treatment/ibra-snobar.png",
    description:
      "شاي أبرة الصنوبر، المعروف أيضًا باسم شاي الصنوبر، هو مشروب شعبي يُصنع من أوراق وأغصان شجرة الصنوبر. يُعتبر هذا الشاي مشروبًا مُفيدًا للصحة ويُشتهر بفوائده العديدة، ومن بينها: غني بالفيتامينات والمعادن: شاي أبرة الصنوبر يحتوي على تركيز عالٍ من الفيتامينات والمعادن مثل فيتامين C وفيتامين A وفيتامين K والبوتاسيوم والمغنيسيوم والكالسيوم وغيرها، مما يجعله مشروبًا مغذيًا. مضاد للأكسدة: يحتوي شاي أبرة الصنوبر على مركبات مضادة للأكسدة مثل الفلافونويد والبوليفينولات، التي تساعد في مكافحة الضرر الناتج عن الجذور الحرة في الجسم. تقوية الجهاز المناعي: يُعتقد أن استهلاك شاي أبرة الصنوبر يمكن أن يعزز جهاز المناعة ويساعد في منع الإصابة بالأمراض.",
  },
  {
    id: 7,
    title: "  زهرة الربيع المسائية وصحة المرأة ",
    image: "../../public/assets/herbal-treatment/rabea-flower.png",
    description:
      "عشبة المورينجا، المعروفة أيضًا بـ”شجرة العشاء” أو “شجرة العسل”، هي نبات يعود أصله إلى جنوب آسيا، وقد اكتسبت شهرة عالمية بفضل فوائدها الصحية المذهلة. تعتبر المورينجا واحدة من أكثر النباتات تنوعًا وفوائدًا في عالم الأعشاب والنباتات الطبية. إذا كنت تتساءل عن ما تحمله عشبة المورينجا بالنسبة لك، فستكتشف أن هذا النبات الرائع يحمل في طياته الكثير من الخير للصحة والعافية",
  },
  {
    id: 8,
    title: "  عشبة الكوهوش الأسود سحر لصحة المرأة ",
    image: "../../public/assets/herbal-treatment/kohosh.png",
    description:
      "عشبة المورينجا، المعروفة أيضًا بـ”شجرة العشاء” أو “شجرة العسل”، هي نبات يعود أصله إلى جنوب آسيا، وقد اكتسبت شهرة عالمية بفضل فوائدها الصحية المذهلة. تعتبر المورينجا واحدة من أكثر النباتات تنوعًا وفوائدًا في عالم الأعشاب والنباتات الطبية. إذا كنت تتساءل عن ما تحمله عشبة المورينجا بالنسبة لك، فستكتشف أن هذا النبات الرائع يحمل في طياته الكثير من الخير للصحة والعافية",
  },
  {
    id: 9,
    title: " اكليل الجبل: فوائد صحية وجمالية مذهلة",
    image: "../../public/assets/herbal-treatment/iklil-algabal.png",
    description:
      "عشبة المورينجا، المعروفة أيضًا بـ”شجرة العشاء” أو “شجرة العسل”، هي نبات يعود أصله إلى جنوب آسيا، وقد اكتسبت شهرة عالمية بفضل فوائدها الصحية المذهلة. تعتبر المورينجا واحدة من أكثر النباتات تنوعًا وفوائدًا في عالم الأعشاب والنباتات الطبية. إذا كنت تتساءل عن ما تحمله عشبة المورينجا بالنسبة لك، فستكتشف أن هذا النبات الرائع يحمل في طياته الكثير من الخير للصحة والعافية",
  },
  {
    id: 10,
    title: "فوائد وضعية رفع الساقين علي الجدار",
    Image: "../../public/assets/theraph-images/image1.png",
    description:
      "توجد العديد من الفوائد لوضعية رفع الساقين على الجدار، ومنها تحسين الدورة الدموية: يعمل هذا التمرين على تحسين تدفق الدم في الجسم، مما يساعد على تخفيف الانتفاخ والتورم في الساقين.  تخفيف التوتر والإجهاد: يعتبر هذا التمرين مناسبًا لتخفيف التوتر والإجهاد في العضلات والمفاصل بعد يوم شاق.",
  },
  {
    id: 11,
    title: "طب تقويم العظام الاستيوبائي-تحسين صحة العمود الفقري",
    Image: "../../public/assets/theraph-images/image2.png",
    description:
      "تقويم العظام الاستيوبائي هو مجال طبي يهتم بتقويم وتصحيح مشاكل وتشوهات في عظام الجسم، بما في ذلك العمود الفقري. تحسين صحة العمود الفقري من خلال تقويم العظام الاستيوبائي يمكن أن يحقق العديد من الفوائد، منها: تحسين موضع العمود الفقري: يعمل التقويم على تصحيح موضع الفقرات في العمود الفقري، مما يساعد على تخفيف الضغط على الأعصاب والأنسجة المحيطة. تقليل الألم: قد يساعد التقويم على تقليل الألم في منطقة الظهر والعنق، وذلك بسبب تحسين موضع الفقرات.",
  },
  {
    id: 12,
    title: "العلاج بالاكوابنكنج",
    Image: "../../public/assets/theraph-images/image3.png",
    description:
      "العلاج بالاكوابنكنج أو العلاج بالكؤوس الشفطية هو إجراء تقليدي يستخدم في الطب التقليدي الصيني والطب التقليدي الشعبي. يتم في هذا العلاج وضع كؤوس زجاجية أو بلاستيكية على الجلد وسحب الهواء من داخل الكؤوس لإنشاء شفط خفيف على الجلد.",
  },
  {
    id: 13,
    title: "انواع المساج والعلاج بالتدليك المختلفة",
    Image: "../../public/assets/theraph-images/image4.png",

    description:
      "هناك العديد من أنواع المساج والعلاج بالتدليك المختلفة، وتشمل بعضها:1. المساج السويدي: يُعتبر المساج السويدي من أكثر أنواع المساج شيوعًا، ويستخدم لتخفيف التوتر والإجهاد، وتحسين الدورة الدموية والاسترخاء العام.المساج العميق: يستخدم المساج العميق للتركيز على الطبقات العميقة من العضلات، ويمكن أن يكون مؤلمًا في بعض الأحيان، ولكن يساعد في تخفيف التوتر والإصابات الرياضية.",
  },
  {
    id: 14,
    title: "تمارين طبيعية لعلاج الكتف المتجمد",
    Image: "../../public/assets/theraph-images/image5.png",

    description:
      "الكتف المتجمد هو حالة تتسبب في صعوبة حركة الكتف والألم نتيجة لالتهاب وتقلص في أنسجة الكتف. يمكن استخدام تمارين طبيعية لعلاج الكتف المتجمد وزيادة مرونة الكتف.",
  },
  {
    id: 15,
    title: "تعرف علي افضل المصادر لبناء عضلات صحية وقويه",
    Image: "../../public/assets/theraph-images/image6.png",
    description:
      "هناك العديد من المصادر التي يمكن الاعتماد عليها لبناء عضلات صحية وقوية. إليك بعض من أفضل المصادر البروتين يعتبر البروتين أساسياً لبناء العضلات، ويمكن الحصول عليه من مصادر غذائية مثل اللحوم البيضاء، الأسماك، البيض، الحليب ومشتقاته، الفول السوداني، البقوليات، والمكسرات. الكربوهيدرات: توفر الكربوهيدرات الطاقة اللازمة لأداء التمارين الرياضية وتعزز نمو العضلات. يمكن الحصول على الكربوهيدرات من المصادر مثل الخضروات، الفواكه، الحبوب الكاملة، والبطاطا",
  },
  {
    id: 16,
    title: "كيف تتخلص من الام الركبة؟اليك الحل",
    Image: "../../public/assets/theraph-images/image7.png",
    description:
      "يؤثر ألم الركبة أيضًا على الرياضيين بشكل متكرر بسبب الإجهاد الذي يضعونه على أجسادهم يومًا بعد يوم، وهناك أمراض شائعة مثل التهاب الأوتار، وهناك المزيد من المشكلات التي يمكن أن تحيط بهذا المفصل المعقد.آلام الركبة مرض شائع بين جميع الأعمار، ويمكن أن يصيب الشابات في وقت مبكر، ويمكن أن ينتج عن التمارين المزمنة، على سبيل المثال كإصابات الجري الشائعة، ويمكن أن تكون مشاكل الركبة أيضًا وراثية، ويمكن أن يصبح ألم الركبة مشكلة تدريجيًا مع تقدم العمر.",
  },
  {
    id: 17,
    title: "فوائدوانواع يوجا الوجة",
    Image: "../../public/assets/theraph-images/image8.png",
    description:
      "هناك العديد من فوائد ممارسة يوجا الوجه، وتشمل بعضها: تقوية عضلات الوجه: ممارسة تمارين اليوجا للوجه يمكن أن تساعد في تقوية عضلات الوجه وتحسين مظهرها. تحسين الدورة الدموية: تمارين اليوجا للوجه يمكن أن تعزز تدفق الدم إلى البشرة، مما يساعد في تحسين لون البشرة وتغذيتها.",
  },
  {
    id: 18,
    title: " ماءالبصل مع العسل وفوائده للسعال",
    Image: "../../public/assets/honey-images/image1.png",
    description:
      "ماء البصل مع العسل هو علاج شعبي تقليدي يستخدم لعلاج السعال وتخفيف الأعراض المرتبطة به. لقد اشتهر هذا العلاج بفوائده الطبية والصحية، ويُعتقد أنه يساعد في تخفيف التهيج في الحلق وتهدئة السعال. إليك بعض الفوائد المحتملة لماء البصل مع العسل للسعال: تهدئة التهيج: يُعتقد أن خصائص مضادة للالتهابات في البصل والعسل يمكن أن تساعد في تهدئة التهيج في الحلق والجهاز التنفسي. تخفيف السعال: قد يساعد ماء البصل مع العسل في تخفيف السعال وتخفيف الامتصاص.",
  },
  {
    id: 19,
    title: "العسل والزنجبيل",
    Image: "../../public/assets/honey-images/image2.png",
    description:
      "العسل من المواد الطبيعية التي يُعتبر منها الفوائد الغذائية والصحية العديدة. يحتوي العسل على عناصر غذائية هامة مثل الفيتامينات والمعادن والأحماض الأمينية التي تعزز صحة الجسم. من فوائد العسل الصحية الشهيرة هي قدرته على تقوية جهاز المناعة، وتحسين عملية الهضم، وتخفيف الالتهابات، والحفاظ على صحة القلب. إضافة إلى ذلك، يُعتبر العسل أيضًا مضادًا للبكتيريا والفيروسات، ويساعد في تهدئة السعال والتهاب الحلق.",
  },
  {
    id: 20,
    title: "العسل الاسود وفوائده التي لاتحصي",
    Image: "../../public/assets/honey-images/image3.png",
    description:
      "العسل الأسود هو نوع من أنواع العسل الطبيعي التي تتميز بلونها الداكن وطعمها الغني. يُعتبر العسل الأسود مصدرًا غنيًا بالعناصر الغذائية والفوائد الصحية التي يمكن أن تكون لها تأثير إيجابي على الصحة. إليك بعض الفوائد المحتملة للعسل الأسود: غني بالمضادات الحيوية: يُعتقد أن العسل الأسود يحتوي على خصائص مضادة للبكتيريا والفطريات التي يمكن أن تساعد في مكافحة العدوى. مضاد للأكسدة: يحتوي العسل الأسود على مركبات مضادة للأكسدة التي تساعد في مكافحة التأكسد الضار في الجسم وتقليل خطر الإصابة بالأمراض المزمنة.",
  },
  {
    id: 21,
    title: "فوائد العسل الخام للشفاء",
    Image: "../../public/assets/honey-images/image4.png",
    description:
      "العسل الخام هو نوع من العسل الطبيعي الذي لم يتم تصفيته أو تسخينه، مما يحافظ على جميع العناصر الغذائية والمركبات الطبيعية الموجودة فيه. لذلك، له فوائد صحية كبيرة ويُستخدم منذ القدم لأغراض العلاج والشفاء. إليك بعض فوائد العسل الخام للشفاء: خصائص مضادة للبكتيريا: يحتوي العسل الخام على مركبات مضادة للبكتيريا التي يمكن أن تساعد في محاربة العدوى وتسريع عملية الشفاء. تهدئة التهابات الحلق: يُعتبر العسل الخام مهدئًا طبيعيًا للتهابات الحلق والسعال، ويمكن استخدامه لتخفيف الألم والتهيج.",
  },
  {
    id: 22,
    title: "عسل المانوكا ومالاتعرفه عن فوائدة",
    Image: "../../public/assets/honey-images/image5.png",
    description:
      "عسل المانوكا هو نوع خاص من العسل يتم الحصول عليه من أزهار شجرة المانوكا التي تنمو في نيوزيلندا. يُعتبر عسل المانوكا مميزًا بفضل خصائصه الطبية القوية والفريدة. إليك بعض المعلومات عن فوائد عسل المانوكا: تأثير مضاد للبكتيريا: يُعتبر عسل المانوكا من أقوى أنواع العسل التي تحتوي على خصائص مضادة للبكتيريا، وخاصة ضد بكتيريا المقاومة للمضادات الحيوية. تعزيز الشفاء: يُستخدم عسل المانوكا لتعزيز عملية الشفاء من الجروح، الحروق، القروح الجلدية، والتهابات الجلد.",
  },
  {
    id: 23,
    title: "استخدامات طبيعية للعسل",
    Image: "../../public/assets/honey-images/image6.png",
    description:
      "العسل له العديد من الاستخدامات الطبيعية والصحية التي تعود إلى خصائصه الفريدة والمفيدة. إليك بعض الاستخدامات الطبيعية للعسل: علاج السعال واحتقان الحلق: يُعتبر العسل مهدئًا طبيعيًا للحلق ويساعد في تخفيف السعال واحتقان الحلق. يمكن تناول ملعقة صغيرة من العسل مباشرة أو إضافته إلى كوب من الماء الدافئ للحصول على تأثير مهدئ. تعزيز جهاز المناعة: يحتوي العسل على مركبات مضادة للبكتيريا والفيروسات التي يمكن أن تساعد في تعزيز جهاز المناعة والوقاية من الأمراض.",
  },
  {
    id: 24,
    title: "فوائد العسل والقرفة",
    Image: "../../public/assets/honey-images/image7.png",
    description:
      "العسل والقرفة هما مكونان طبيعيان مذهلان يتمتعان بخصائص صحية وعلاجية متعددة عند استخدامهما معًا. إليك بعض فوائد العسل والقرفة الرئيسية: تحسين الجهاز المناعي: يُعتقد أن مزيج العسل والقرفة يساعد في تعزيز جهاز المناعة وحماية الجسم من الأمراض والالتهابات. تخفيف التهابات الجهاز التنفسي: يُعتبر مزيج العسل والقرفة مهدئًا للحلق ومضادًا للبكتيريا، مما يساعد في تخفيف التهابات الجهاز التنفسي مثل نزلات البرد والتهاب الحلق.",
  },
  {
    id: 25,
    title: "اهم الاعشاب لعلاج الربو",
    image: "../../public/assets/treating diseeses/image3.jpg",
    description:
      "هناك العديد من الأعشاب التي يُعتقد أنها تساعد في علاج الربو أو تخفيف أعراضه. ومع ذلك، يجب عليك دائمًا استشارة الطبيب قبل استخدام أي عشبة أو علاج طبيعي لعلاج الربو، حيث أنه قد يتداخل مع العلاجات الطبية التقليدية التي تتناولها. إليك بعض الأعشاب التي يُعتقد أنها تساعد في علاج الربو: الزنجبيل: يُعتبر الزنجبيل من الأعشاب المضادة للالتهابات والمسكنة، ويُمكن استخدامه لتخفيف التهابات الجهاز التنفسي وتحسين التنفس. الكركم: يحتوي الكركم على مركب يُسمى الكركمين، والذي يُعتقد أنه له خصائص مضادة للالتهابات ومضادة للحساسية، ويُمكن استخدامه لتخفيف أعراض الربو.",
  },
  {
    id: 26,
    title: "اسباب حصوات الكلي",
    image: "../../public/assets/treating diseeses/image2.jpg",
    description:
      "حصى الكلى هي ترسبات صلبة تتكون في الكلى نتيجة لتراكم المواد الكيميائية في البول. هناك عدة أسباب محتملة لتكون حصى الكلى، منها: ارتفاع تركيز بعض المواد في البول: عندما تكون تركيزات بعض المواد مثل الكالسيوم أو اليوريا أو حمض الأوريك في البول مرتفعة جدًا، يمكن أن تتكاثر هذه المواد وتتشكل حصى. قلة شرب الماء: عدم شرب كمية كافية من الماء يمكن أن يؤدي إلى تركز المواد الكيميائية في البول وزيادة احتمال تكون حصى الكلى.",
  },
  {
    id: 27,
    title: "الماء المالح واستخداماته في علاج الصداع",
    image: "../../public/assets/treating diseeses/image1.jpg",
    description:
      "الماء المالح هو محلول ماء ممزوج بالملح، ويُستخدم في بعض الحالات كعلاج للصداع. إليك بعض الاستخدامات المحتملة للماء المالح في علاج الصداع: توازن الكهارلية: يُعتقد أن تناول محلول ماء مالح يمكن أن يساعد في استعادة توازن الكهارلية في الجسم، خاصة إذا كان الصداع ناتجًا عن فقدان الملح والسوائل. تخفيف التوتر: قد يساعد تناول الماء المالح في تخفيف التوتر والضغط النفسي، مما يمكن أن يساهم في تقليل حدة الصداع.",
  },
  {
    id: 28,
    title: "علاج السعال وتخفيف اعراضه بجوز الهند",
    image: "../../public/assets/treating diseeses/image6.jpg",
    description:
      "جوز الهند يعتبر من الأطعمة الغنية بالعناصر الغذائية والمركبات الفعالة التي يمكن أن تساعد في علاج السعال وتخفيف أعراضه. إليك بعض الطرق التي يمكن استخدام جوز الهند في علاج السعال: عصير جوز الهند: يمكن شرب عصير جوز الهند لترطيب الحلق وتخفيف التهيج الناجم عن السعال. يمكنك خلط عصير جوز الهند مع ملعقة من عسل طبيعي لتحسين طعمه وزيادة فوائده. زيت جوز الهند: يُعتقد أن زيت جوز الهند له خصائص مضادة للبكتيريا والفيروسات، ويمكن استخدامه لتدليك الصدر والظهر لتخفيف الاحتقان وتهدئة السعال.",
  },
  {
    id: 29,
    title: "التخلص من الامساك عن طريق الماء",
    image: "../../public/assets/treating diseeses/image5.jpg",
    description:
      "الماء هو عنصر أساسي لصحة الجهاز الهضمي ويمكن أن يلعب دوراً هاماً في علاج الإمساك. إليك بعض الطرق التي يمكن استخدام الماء للتخلص من الإمساك: زيادة تناول الماء: تناول كمية كافية من الماء يومياً يساعد على تليين البراز وتحفيز حركة الأمعاء، مما يساعد في التخلص من الإمساك. شرب الماء الدافئ: شرب كوب من الماء الدافئ صباحاً على معدة فارغة يمكن أن يحفز حركة الأمعاء ويسهل عملية الهضم.",
  },
  {
    id: 30,
    title: "هل تقلل الحمضيات خطر الاصابة بالخرف",
    image: "../../public/assets/treating diseeses/image4.jpg",
    description:
      "توجد بعض الدراسات التي تشير إلى أن تناول الحمضيات والفواكه الحمضية بشكل عام، مثل البرتقال والليمون والجريب فروت، قد يساهم في تقليل خطر الإصابة بأمراض مثل الخرف. تحتوي الحمضيات على مضادات الأكسدة والفيتامينات المفيدة للصحة العامة، والتي قد تساعد في حماية الدماغ والحفاظ على وظائفه العقلية.",
  },
  {
    id: 31,
    category:    "السرطان",
    title: "فوائد الثوم الصحية",
    image: "../../public/assets/treating diseeses/image9.jpg",
    description:
      "يعتبر الثوم من الأطعمة الصحية والمفيدة للجسم، ويحتوي على العديد من الفوائد الصحية، منها: يحتوي الثوم على مركبات كبريتية تساعد في خفض ضغط الدم وتحسين صحة القلب. يعتبر الثوم مضاداً للبكتيريا والفطريات، مما يساعد في تقوية جهاز المناعة.",
  },
  {
    id: 32,
    category:    " الحساسيه",
    title: "العلاج الافضل لمتلازمه التمثيل الغزائي",
    image: "../../public/assets/treating diseeses/image8.jpg",
    description:
      "تعتبر متلازمة التمثيل الغذائي من الحالات الصحية التي تتطلب عناية خاصة وعلاج متخصص. وفي هذا المقال سنسلط الضوء على العلاج الأفضل لمتلازمة التمثيل الغذائي. تغذية متوازنة: يعد تناول طعام صحي ومتوازن أحد أهم عوامل علاج متلازمة التمثيل الغذائي. يجب تضمين جميع المجموعات الغذائية بشكل مناسب في وجباتك اليومية. مراقبة الوزن: من المهم مراقبة وزنك بانتظام للحفاظ على صحة جسدك والوقاية من مشاكل صحية أخرى.",
  },
  {
    id: 34,
    category:    " الحساسيه",
    title: "العلاقة بين الربو وامراض القلب",
    image: "../../public/assets/treating diseeses/image7.jpg",
    description: "",
  },
  {
    id: 35,
    category:    " الحساسيه",
    title: "فوائد بزور الكتان",
    image: "../../public/assets/treating diseeses/image10.jpg",
    description:
      "تشير بعض الدراسات إلى أن التهابات الشعبية المزمنة التي تحدث في حالات الربو قد تؤدي إلى تضخم في عضلة القلب وتغيرات في نسيجه، مما يزيد من خطر الإصابة بأمراض قلبية مثل احتشاء عضلة القلب وارتفاع ضغط الدم.",
  },
  {
    id: 36,
    category:    "السرطان",
    title: "فوائد الثوم الصحية",
    image: "../../public/assets/treating diseeses/image9.jpg",
    description:
      "يعتبر الثوم من الأطعمة الصحية والمفيدة للجسم، ويحتوي على العديد من الفوائد الصحية، منها: يحتوي الثوم على مركبات كبريتية تساعد في خفض ضغط الدم وتحسين صحة القلب. يعتبر الثوم مضاداً للبكتيريا والفطريات، مما يساعد في تقوية جهاز المناعة.",
  },
  {
    id: 37,
    category:    "صحة الجهاز الهضمي",
    title: "هل تقلل الحمضيات خطر الاصابة بالخرف",
    image:"../../public/assets/treating diseeses/image4.jpg",
    description:
      "توجد بعض الدراسات التي تشير إلى أن تناول الحمضيات والفواكه الحمضية بشكل عام، مثل البرتقال والليمون والجريب فروت، قد يساهم في تقليل خطر الإصابة بأمراض مثل الخرف. تحتوي الحمضيات على مضادات الأكسدة والفيتامينات المفيدة للصحة العامة، والتي قد تساعد في حماية الدماغ والحفاظ على وظائفه العقلية.",
  },
  {
    id: 38,
    category:    "صحة الجهاز الهضمي",
    title: "التخلص من الامساك عن طريق الماء",
    image:"../../public/assets/treating diseeses/image5.jpg",
    description:
      "الماء هو عنصر أساسي لصحة الجهاز الهضمي ويمكن أن يلعب دوراً هاماً في علاج الإمساك. إليك بعض الطرق التي يمكن استخدام الماء للتخلص من الإمساك: زيادة تناول الماء: تناول كمية كافية من الماء يومياً يساعد على تليين البراز وتحفيز حركة الأمعاء، مما يساعد في التخلص من الإمساك. شرب الماء الدافئ: شرب كوب من الماء الدافئ صباحاً على معدة فارغة يمكن أن يحفز حركة الأمعاء ويسهل عملية الهضم.",
  },
  {
    id: 39,
    category:    "صحة الجهاز الهضمي",
    title: "فوائد الثوم الصحية",
    image: "../../public/assets/treating diseeses/image9.jpg",
    description:
      "يعتبر الثوم من الأطعمة الصحية والمفيدة للجسم، ويحتوي على العديد من الفوائد الصحية، منها: يحتوي الثوم على مركبات كبريتية تساعد في خفض ضغط الدم وتحسين صحة القلب. يعتبر الثوم مضاداً للبكتيريا والفطريات، مما يساعد في تقوية جهاز المناعة.",
  },
  {
    id: 40,
    category:    "صحة الجهاز الهضمي",
    title: "فوائد زيت السمك",
    image:"../../public/assets/treating diseeses/image11.jpg",
    description:
      "زيت السمك هو مصدر قيم للعديد من العناصر الغذائية الهامة، ويعتبر من بين الإضافات الغذائية الأكثر فائدة للصحة والعافية. يُستخرج زيت السمك عادةً من أسماك مثل السلمون والتونة والسردين، ويحتوي على نسب عالية من أحماض أوميغا-3 وفيتامينات ومعادن أخرى. في هذا المقال، سنتناول فوائد زيت السمك للصحة والتأثير الإيجابي الذي يمكن أن يكون له على جسم الإنسان. الأحماض الدهنية أوميغا-",
  },
  {
    id: 41,
    category:    "القلب والاوعيه الدمويه",
    title: "الكوليسترول وصحة القلب",
    image: "../../public/assets/treating diseeses/image13.jpg",
    description:
      "الكوليسترول هو مركب دهني ضروري للجسم، لكن تراكمه الزائد قد يؤدي إلى مشاكل صحية خطيرة، مثل أمراض القلب. في هذا المقال، سنتعرف على أهمية مراقبة مستويات الكوليسترول وكيفية الحفاظ على صحة قلبية جيدة بأساليب تتوافق مع تقنيات السيو.",
  },
  {
    id: 24,
    category:    "القلب والاوعيه الدمويه",
    title: "فوائد القهوة للقلب والجسم والبشره والصحة العامة",
    image: "../../public/assets/treating diseeses/image12.jpg",
    description:
      " يجب تناول القهوة بشكل معتدل، حيث إفراطها قد يؤدي إلى الأعراض الجانبية مثل القلق واضطراب المعدة. ينصح بعدم إضافة كميات كبيرة من السكر والدهون إلى القهوة للحفاظ على فوائدها الصحية. القهوة ليست مناسبة للجميع، فبعض الأشخاص قد يكونون حساسين للكافيين ويحتاجون إلى تقليل استهلاكها.",
  },
  {
    id: 34,
    category:    "القلب والاوعيه الدمويه",
    title: "فوائد الثوم الصحية",
    image: "../../public/assets/treating diseeses/image9.jpg",
    description:
      "يعتبر الثوم من الأطعمة الصحية والمفيدة للجسم، ويحتوي على العديد من الفوائد الصحية، منها: يحتوي الثوم على مركبات كبريتية تساعد في خفض ضغط الدم وتحسين صحة القلب. يعتبر الثوم مضاداً للبكتيريا والفطريات، مما يساعد في تقوية جهاز المناعة.",
  },
  {
    id: 44,
    category:    "القلب والاوعيه الدمويه",
    title: "المواد الطبيعية التي تساعد في خفض ضغط الدم المرتفع",
    image:"../../public/assets/treating diseeses/image14.jpg",
    description:
      "البوتاسيوم,الزنك,الفيتامين ,المغنيسيوم,الثوم,الزنجبيل,الألياف,الزعرور,الاهتمام بصحة القلب وخفض ضغط الدم يتطلب تضمين هذه المواد الطبيعية في نظامك الغذائي والحفاظ على نمط حياة صحي. يجب أن يكون النصائح الغذائية والتغييرات في نمط الحياة جزءًا من استراتيجيتك للمحافظة على صحة قلبك وتجنب مضاعفات ضغط الدم المرتفع.",
  },
  {
    id:45,
    title:"طرق لتبيض الاسنان بشكل طبيعي",
    image: "../../public/assets/treating diseeses/image15.png",
    category:    "صحة الاسنان",
    description:"1. استخدم خل التفاح من المنطقي أن يكون خل التفاح (ACV)، الذي يعمل بشكل فعال كمضاد حيوي طبيعي ومنظف للأسنان / اللثة، قادراً أيضاً على إزالة البقع العنيدة على الأسنان. خل التفاح مفيد بشكل خاص في إزالة البقع بسبب المسببات الشائعة مثل القهوة والنيكوتين (التدخين). يحتوي على مركبات، بما في ذلك حمض الأسيتيك والبوتاسيوم والمغنيسيوم والبروبيوتيك والإنزيمات، التي تقتل الجراثيم (البكتيريا “السيئة” الخطرة) وفي نفس الوقت تعزز نمو بكتيريا البروبيوتيك المفيدة “الجيدة”. نظراً لكونه حامضياً بشكل طبيعي، فإنه يساعد في تكسير البلاك أو المواد الأخرى الملتصقة بالأسنان."
},
];
